
if __name__ == '__main__':
    def replace_element(tup, old_elem, new_elem):
        """
        Заменя елемент в кортежа с друг елемент.

        :param tup: кортежът, в който да се направи замяната
        :param old_elem: елементът, който да бъде заменен
        :param new_elem: новият елемент, който да бъде поставен
        :return: нов кортеж със заменения елемент
        """
        new_tup = tuple(new_elem if x == old_elem else x for x in tup)
        return new_tup


    # дефинираме кортежа
    tup = (22, 33, 44.5, 55, 66, 11, "Apple", "Banana", 33.3)

    # извеждаме кортежа преди замяната
    print("Кортежът преди замяната:", tup)

    # питаме потребителя за новия елемент
    new_elem = input("Въведете нов елемент: ")

    # заменяме елемента "Banana" с новия елемент
    tup = replace_element(tup, "Banana", new_elem)

    # извеждаме кортежа след замяната
    print("Кортежът след замяната:", tup)

    # ЗАМЯНА НА ЕЛЕМЕНТ ОТ МАСИВА

    def replace_element(tup, index, new_elem):
        """
        Заменя елемент в кортежа с друг елемент.

        :param tup: кортежът, в който да се направи замяната
        :param index: индексът на елемента, който да бъде заменен
        :param new_elem: новият елемент, който да бъде поставен
        :return: нов кортеж със заменения елемент
        """
        lst = list(tup)
        lst[index] = new_elem
        new_tup = tuple(lst)
        return new_tup


    # дефинираме кортежа
    tup = (22, 33, 44.5, 55, 66, 11, "Apple", "Banana", 33.3)

    # извеждаме кортежа преди замяната
    print("Кортежът преди замяната:", tup)

    # питаме потребителя за новия елемент и индекса на елемента, който да бъде заменен
    new_elem = input("Въведете нов елемент: ")
    index = int(input("Въведете индекса на елемента, който да бъде заменен: "))

    # заменяме елемента на посочения индекс с новия елемент
    tup = replace_element(tup, index, new_elem)

    # извеждаме кортежа след замяната
    print("Кортежът след замяната:", tup)